'use strict';
// Работа с переменными
// 1. Объявите две переменные: admin и name.
// 2. Запишите строку "Джон" в переменную name.
// 3. Скопируйте значение из переменной name в admin.
// 4. Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

let admin, name; //  можно объявить две переменные через запятую
name = 'John';
admin = name;
alert (admin);

// Придумайте правильные имена

// 1. Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// 2. Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

const ourPlanetName = 'Planet';
const currentUserName = "Джон";


// Вызвать alert
//  Создайте страницу, которая отобразит сообщение «Я JavaScript!».

// 2. Покажите сообщение с помощью внешнего скрипта
// Возьмите решение предыдущей задачи Вызвать alert, и измените его. Извлеките содержимое скрипта во внешний файл alert.js, лежащий в той же папке.

// Откройте страницу, убедитесь, что оповещение работает.
alert('Im Java Script!');

// Работа с переменными
// Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).





// Придумайте правильные имена
// 1.Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// 2.Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?




// Какие буквы (заглавные или строчные) использовать для имён констант?
// Рассмотрим следующий код: const birthday = '18.04.1982';
//                         const age = someCode(birthday);
// У нас есть константа birthday, а также age, которая вычисляется при помощи некоторого кода, используя значение из birthday (в данном случае детали не имеют значения, поэтому код не рассматривается).

// Можно ли использовать заглавные буквы для имени birthday? А для age? Или одновременно для обеих переменных?
// const BIRTHDAY = '18.04.1982';            использовать заглавные буквы?
// const AGE = someCode(BIRTHDAY);               а здесь?
